app/Controllers/Home.php

  public function index(): string
  {
    $model = new UserModel();
    $data['user'] = $model->findAll();
---
SELECT *
FROM `Users`

  public function add()
  {
    $session = session();
    $model = new UserModel();
    $data = [
      'first_name' => $this->request->getPost('first_name'),
      'last_name' => $this->request->getPost('last_name'),
      'email' => $this->request->getPost('email'),
      'age' => $this->request->getPost('age'),
      'username' => $this->request->getPost('username'),
      'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
    ];
    $model->insert($data);
---
INSERT INTO `Users` (`first_name`, `last_name`, `email`, `age`, `username`, `password`) VALUES ('hello', 'hi', 'hi@gmail.com', '25', 'hi', '$2y$10$F2oH4LsNs.uS9sLYqIMBoueTQoaDrgIgMrDffo57S.zaVrZ1YhyYG')

  public function delete($id)
  {
    $session = session();
    $model = new UserModel();
    $model->delete($id);
---
DELETE FROM `Users`
WHERE `id` IN ('4')

  public function search()
  {
    $session = session();
    $key = $this->request->getGet("key");
    if ($key == "") {
      return redirect()->to("/");
    }
    $model = new UserModel();
    $data["user"] = $model->like("first_name", $key)->orLike("last_name", $key)->orLike("age", $key)->orLike("username", $key)->orLike("id", $key)->findAll();
---
SELECT *
FROM `Users`
WHERE `first_name` LIKE '%hubs%' ESCAPE '!'
OR  `last_name` LIKE '%hubs%' ESCAPE '!'
OR  `age` LIKE '%hubs%' ESCAPE '!'
OR  `username` LIKE '%hubs%' ESCAPE '!'
OR  `id` LIKE '%hubs%' ESCAPE '!'